Repository: freemint/freemint
Catalog: xaaes/src.*/po/*.po
Languages: cs, de, es, fr, hu, it, ru

source: Process
cs: Proces
de: Prozess
es: Proceso
fr: Processus
hu: Folyamat
it: Processo
ru: Процесс

source: About XaAES ^007Help
cs: O XaAES ^007Help
de: Über XaAES ^007Help
es: Acerca de ^007Help
fr: A propos de ^007Help
hu: XaAES névjegye ^007Help
it: Circa XaAES ^007Help
ru: О XaAES ^007Help

source: Launch Program... ^007K
cs: Spustit program... ^007K
de: Programm starten... ^007K
es: Ejecutar programa... ^007K
fr: Lancer un progamme... ^007K
hu: Program indítása... ^007K
it: Avvia Programma... ^007K
ru: Запустить программу... ^007K

source: Launch Desk
cs: Spustit plochu
de: Desktop starten
es: Ejecutar Escritorio
fr: Lancer le bureau
hu: Desktop indítása
it: Avvia Scrivania
ru: Запустить десктоп

source: Task Manager ^007L
cs: Správce úloh... ^007L
es: Gestor de tareas... ^007L
fr: Gestionnaire de tâches ^007L
hu: Feladat Kezelö... ^007L
ru: Менеджер задач... ^007L

source: System ^007B
cs: Systém... ^007B
es: Sistema... ^007B
fr: Système... ^007B
hu: Rendszer... ^007B
it: Sistema... ^007B
ru: Система... ^007B

source: Quit all Apps ^007A
cs: Ukonèit v¹echny programy ^007A
de: Alle Apps beenden ^007A
es: Terminar todo ^007A
fr: Quitter toutes les applis ^007A
hu: Programok bezárása ^007A
it: Chiudi tutte le app. ^007A
ru: Закрыть все программы ^007A

source: Restart XaAES ^007J
cs: Restartujte XaAES ^007J
de: XaAES neustarten ^007J
es: Reinicializar XaAES ^007J
fr: Redémarrer XaAES ^007J
hu: XaAES újraindítása ^007J
it: Riavvia XaAES ^007J
ru: Перезапустить XaAES ^007J

source: Quit XaAES ^007Q
cs: Ukonèit XaAES ^007Q
de: XaAES beenden ^007Q
es: Terminar XaAES ^007Q
fr: Quitter XaAES ^007Q
hu: XaAES bezárása ^007Q
it: Chiudi XaAES ^007Q
ru: Выйти из XaAES ^007Q

source: Options
cs: Volby
de: Optionen
es: Opciones
hu: Beállítások
it: Opzioni
ru: Опции

source: File
cs: Soubor
de: Datei
es: Fichero
fr: Fichier
hu: Fájl
ru: Файл

source: Realtime build directories ^B
cs: Adresáøe v reálném èase ^B
de: Echtzeit-Anzeige ^B
es: Directorios en tiempo real ^B
fr: Affichage en temps réel ^B
hu: Valós idejü könyvtár megj. ^B
it: Directory in tempo reale ^B
ru: Директории в реальном времени ^B

source: Tree view ^T
cs: Stromový pohled ^T
de: Baumansicht ^T
es: Vista de árbol ^T
fr: Affichage en arborescence ^T
hu: Fa szerü megjelenítés ^T
it: Vista ad albero ^T
ru: В виде дерева ^T

source: Sort by Name ^N
cs: Seøadit podle jména ^N
de: Nach Namen sortiert ^N
es: Ordenar por Nombre ^N
fr: Tri par nom ^N
hu: Név szerinti sorrend ^N
it: Ordina per nome ^N
ru: Сортировать по имени ^N

source: Sort by Date ^D
cs: Seøadit podle data ^D
de: Nach Datum sortiert ^D
es: Ordenar por fecha ^D
fr: Tri par date ^D
hu: Dátum szerinti sorrend ^D
it: Ordina per data ^D
ru: Сортировать по дате ^D

source: Sort by Size ^S
cs: Seøadit podle velikosti ^S
de: Nach Gr÷ße sortiert ^S
es: Ordenar por Tamaño ^S
fr: Tri par taille ^S
hu: Méret szerinti sorrend ^S
it: Ordina per dimensioni ^S
ru: Сортировать по размеру ^S

source: Sort by Ext ^E
cs: Seøadit podle typu ^E
de: Nach Extension sortiert ^E
es: Ordenar por Tipo ^E
fr: Tri par type ^E
hu: Típus szerinti sorrend ^E
it: Ordina per tipo ^E
ru: Сортировать по типу ^E

source: No sorting ^X
cs: Nesetøídìnì ^X
de: Unsortiert ^X
es: Sin ordenar ^X
fr: Pas de tri ^X
hu: Rendezetlen ^X
it: Nessun ordine ^X
ru: Не сортировать ^X

source: Reverse sort order ^SPACE
de: Sortierung umkehren ^SPACE
es: Revertir orden ^SPACE
fr: Inverser l'ordre ^SPACE
hu: Fordított sorrend ^SPACE
it: Inverti l'ordine ^SPACE
ru: Обратный порядок ^SPACE

source: Copy path/filename ^C
de: Pfad/Dateiname kopieren ^C
es: Copiar ruta/marcado ^C
fr: Copie chemin/nom ^C
it: Copia percorso/nome ^C
ru: Копировать путь/имя файла ^C

source: Create new folder ^F
de: Neuer Ordner ^F
es: Crear ventana ^F
fr: Nouveau dossier ^F
hu: Mappa létrehozása
it: Nuova cartella ^F
ru: Создать папку ^F

source: Rename ^R
de: Umbenennen ^R
es: Renombrar ^R
fr: Renommer ^R
it: Rinomina ^R
ru: Переименовать ^R

source: View ^V
de: Anzeigen ^V
es: Visualizar ^V
fr: Voir ^V
hu: Mutatása
it: Visione ^V
ru: Просмотреть ^V

source: Delete DEL
de: L÷schen DEL
es: Borrar DEL
fr: Effacer DEL
hu: Törlése DEL
it: Cancella DEL
ru: Удалить DEL

source: The GEM277 compatible AES for FreeMiNT
cs: GEM(R) kompatibilní AES pro FreeMiNT
es: El AES compatible GEM™ para FreeMiNT
fr: L'AES compatible GEM277 pour FreeMiNT
hu: A GEM277 kompatibilis AES FreeMiNT-hez
ru: AES, совместимая с GEM277 для FreeMiNT

source: Version:
cs: Verze :
es: Versión:
hu: Verzió :
it: it
ru: Версия :

source: Date :
cs: Datum :
de: Datum :
es: Fecha :
hu: Dátum :
it: Data :
ru: Дата :

source: Target :
de: System :
es: Sitema :
fr: Système:
hu: Cél :
it: Sistema:
ru: Цель :

source: Quit all Apps
cs: Ukonèit v¹e
de: Alle beenden
es: Terminar todo
fr: Tout quitter
hu: Minden alk. bezár
it: Chiudi tutto
ru: Закрыть все

source: Reboot
cs: Restart
de: Warmstart
es: Reiniciar
fr: Redémarrer
hu: újraindítás
it: Riavvia
ru: Перезагрузить

source: Quit XaAES
cs: Ukonèit XaAES
de: XaAES beenden
es: Terminar XaAES
fr: Quitter XaAES
hu: XaAES bezárása
it: Arresto XaAES
ru: Выйти из XaAES

source: Halt
cs: Zastavit
de: Shutdown
es: Apagar
fr: Eteindre
hu: Leállítás
it: Arresto
ru: Выключить

source: Coldboot
cs: Studený start
de: Kaltstart
es: Reinicio duro
fr: Réallumer
hu: Hideg indítás
it: Avvio a freddo
ru: Холодный старт

source: Toggle load
cs: Vyp/zap graf
de: Auslastung an/aus
es: Carga Si/No
fr: Voir/cacher charge
hu: Terhelés ki/be
it: Utilizzo Si/No
ru: Загрузка вкл/выкл

source: SYSTEM-LOAD
cs: Zátì¾
de: AUSLASTUNG
es: CARGA
fr: CHARGE
hu: Terhelés
it: UTILIZZO
ru: ЗАГРУЗКА

source: Clear
cs: Vyèistit
de: Aufräumen
es: Limpiar
fr: Effacer
hu: Törlés
it: Pulizia
ru: Очистить

source: Cancel
cs: Zru¹it
de: Abbruch
es: Anular
fr: Annuler
hu: Mégsem
it: Annulla
ru: Отмена

source: Font
es: Fuente
fr: Corps
it: Fonte
ru: Шрифта

source: is still running. Action?
cs: stále bì¾í? Jak postupovat?
de: ist noch aktiv. Was nun?
es: todavía está activo. ¿Acción?
fr: tourne toujours. Que faire ?
hu: még fut. Hogyan tovább?
it: è in esecuzione. Azioni?
ru: еще работает. Действия7 ?

source: Wait
cs: Poèkat
de: Warten
es: Espere
fr: Attendre
hu: Várakozás
it: Attendere
ru: Ждать

source: Kill
cs: Zabít
de: Beenden
es: Terminar
fr: Arrêter
hu: Kilövés
it: Terminare
ru: Остановить

source: Shutting down
cs: Vypínám systém
de: Shutdown
es: Apagando
fr: Extinction
hu: Leállítás
it: Arresto
ru: Выключается

source: Kill'em All
cs: Zabít v¹e
de: Alle beenden
es: Terminar todo
fr: Tout arrêter
hu: Mind kilövése
it: Termina tutto
ru: Прервать все

source: Set
cs: Nastavit
de: Setzen
es: Aplicar
fr: Appliquer
hu: Beáll.
it: Applica
ru: Установить

source: Mark
cs: Oznaèit
de: Markieren
es: Marcar
fr: Marquer
hu: Jel.
it: Marca
ru: Метка

source: User definable
cs: Nastavitelné
de: Benutzerdefiniert
es: Definible
fr: Défini par utilisateur
hu: Szabadon beáll.
it: Definito dall'utente
ru: Выбираемый пользователем

source: Point:
cs: Bod:
de: Gr÷ße:
es: Tamaño:
hu: Méret:
it: Punto:
ru: Размер:

source: W/H:
cs: ©/V:
de: B/H:
es: An/Al
fr: L/H:
hu: Szé/Ma
it: L/A:
ru: Ш/В

source: Display style
cs: Obrazovka
de: Stil anzeigen
es: Mostrar
fr: Afficher
hu: Képernyö
it: Visione
ru: Показать

source: Driver:
cs: Ovladaè:
de: Gerät:
es: Dispositivo:
fr: Pilote:
hu: Eszközkezelö:
it: Dispositivo:
ru: Драйвер:

source: all
cs: v¹e
de: alle
es: todo
fr: tout
hu: Összes
it: tutto
ru: все

source: from
cs: od
de: von
es: desde
fr: de
hu: tól
it: da
ru: из

source: Even
cs: Sudé
de: gerade
es: Par
fr: Paires
hu: Páros
it: Pari
ru: четные

source: Odd
cs: Liché
de: ungerade
es: Impar
fr: Impair
hu: Páratlan
it: Dispari
ru: нечетные

source: Quality:
cs: Kvalita:
de: Qualität:
es: Calidad:
fr: Qualité:
hu: Minöség:
it: Qualità:
ru: Качество:

source: Pages:
cs: Strany:
de: Seiten:
es: Páginas:
hu: Oldalak:
it: Pagine:
ru: Страницы:

source: Copies:
cs: Kopie:
de: Kopien:
es: Copias:
hu: Másolatok:
it: Copie:
ru: Копии:

source: to
cs: do
de: bis
es: a
fr: à
hu: ig
it: a
ru: в

source: Scale:
cs: Mìøítko:
de: Gr÷ße:
es: Escala:
fr: Echelle:
hu: Méret:
it: Scala:
ru: Масштаб:

source: Paper:
cs: Papír:
de: Papier:
es: Papel:
fr: Papier:
hu: Papír:
it: Carta:
ru: Бумага:

source: Output tray:
cs: Výstup:
de: Auswurf:
es: Bandeja de salida:
fr: Bac de sortie:
hu: Kiadó tálca:
it: Vassoio di uscita:
ru: Выходная подача:

source: Input tray:
cs: Podavaè:
de: Einzug:
es: Bandeja de entrada:
fr: Bac d'entrée:
hu: Adagoló tálca:
it: Vassoio di ingresso:
ru: Входная подача:

source: Raster:
cs: Rastr:
es: Cuadrícula:
fr: Bitmap:
hu: Rács:
it: Trama:
ru: Растр:

source: Port:
cs: Rozhraní:
de: Anschluss:
es: Puerto:
hu: Csatlakozó:
it: Porta:
ru: Порт:

source: in the background
cs: na pozadí
de: im Hintergrund
es: en segundo plano
fr: En arrière-plan
hu: háttérben
it: in secondo piano
ru: в теневом режиме

source: in the foreground
cs: na popøedí
de: im Vordergrund
es: en primer plano
fr: En avant-plan
hu: elötérben
it: in primo piano
ru: поверх всех

source: Print:
cs: Tisk:
de: Drucken:
es: Imprimir:
fr: Imprimer:
hu: Nyomtatás:
it: Stampa:
ru: Печать:

source: Part of FreeMiNT (https://freemint.github.io/).
de: Teil von FreeMiNT (https://freemint.github.io/).
es: Parte de FreeMiNT (https://freemint.github.io/).
fr: Fait partie de FreeMiNT (https://freemint.github.io/).
hu: FreeMiNT része (https://freemint.github.io/).
it: Parte di FreeMiNT (https://freemint.github.io/).
ru: Часть FreeMiNT (https://freemint.github.io/).

source: The terms of the <b>GPL version 2</b> or later apply.
cs: Øídí se ustanoveními <b>GPL verze 2</b> nebo novìj¹í.
de: Es gilt die <b>GPL version 2</b> oder später.
es: Se aplican los terminos de la <b>GPL versión 2</b> o posterior.
fr: Les termes de la <b>GPL version 2</b> ou plus sont d'application.
hu: <b>GPL version 2</b> vagy késöbbi vonatkozik rá.
it: Si applicano i termini <b>GPL versione 2</b> o successivi.
ru: Удовлетворяет условиям <b>GPL версии 2</b>.

source: Windows
cs: Okna
de: Fenster
es: Ventanas
fr: Fenêtres
hu: Ablakok
it: Finestre
ru: Окна

source: Advanced
cs: Pokroèilé
de: Erweitert
es: Avanzado
fr: Avancé
hu: Bövebb
it: Avanzato
ru: Дополнит.

source: To desktop
cs: Na plochu
de: Zum Desktop
es: Escritorio
fr: Au bureau
hu: Desktop-hoz
it: ->Scrivania
ru: К десктопу

source: Close
cs: Zavøít
de: Schliessen
es: Cerrar
fr: Fermer
hu: Bezár
it: Chiudi
ru: Закрыть

source: Hide
cs: Skrýt
de: Verstecken
es: Ocultar
fr: Cacher
hu: Elrejt
it: Nascondi
ru: Скрыть

source: Iconify
cs: Ikonifikovat
de: Als Icon
es: Minimizar
fr: Icônifier
hu: Kicsinyítés
it: Iconizza
ru: Иконизир.

source: Shade
cs: Zarolovat
de: Einklappen
es: Ensombrecer
fr: Masquer
hu: µrnyékolás
it: Ombreggia
ru: Затенить

source: Move
cs: Pøesunout
de: Verschieben
es: Mover
fr: Déplacer
hu: Mozgatás
it: Sposta
ru: Переместить

source: Resize
cs: Zmìna velik.
de: Gr÷ße ändern
es: Dimensionar
fr: Redimension.
hu: Méretezés
it: Ridimens.
ru: Изм. размер

source: Quit
cs: Ukonèit
de: Beenden
es: Terminar
fr: Quitter
hu: Kilépés
it: Esci
ru: Выйти

source: Keep above others
cs: Dr¾et nad ostatními
de: Über den anderen
es: Mantener delante
fr: Maintenir au-dessus
hu: Többiek elött
it: Tieni al di sopra
ru: Поверх всех окон

source: Keep below others
cs: Dr¾et pod ostatními
de: Unter den anderen
es: Mantener detras
fr: Maintenir en dessous
hu: Többiek mögött
it: Tieni al di sotto
ru: За всеми окнами

source: Toolbox attribute
cs: Jako okno nástrojù
de: Toolbox Attribut
es: Atributo Toolbox
fr: Attribut toolbox
hu: Toolbox tulajd.
it: Attributi Toolbox
ru: Атрибуты панели инструментов

source: Deny keyboard focus
cs: Neovládat klávesnicí
de: Kein Tastatur-Fokus
es: Sin foco de teclado
fr: Interdire entrées clavier
hu: Nem kaphat fókuszt
it: Focus tastiera interdetto
ru: Запрет фокуса клавиатуры

source: This
cs: Toto
de: Dieses Fenster
es: Este
fr: Celle-ci
hu: Ez
it: Questo
ru: Это

source: All
cs: V¹echny
de: Alle
es: Todos
fr: Toutes
hu: Mind
it: Tutti
ru: Все

source: All others
cs: V¹echny ostatní
de: Alle anderen
es: Todos los demás
fr: Toutes les autres
hu: Többi
it: Tutti gli altri
ru: Все остальные

source: Restore all
cs: Obnovit v¹echny
de: Alle hervorholen
es: Restaurar todos
fr: Tout restaurer
hu: Mind visszaállítása
it: Ripristina tutto
ru: Восстановить все

source: Restore all others
cs: Obnovit v¹echny ostatní
de: Andere hervorholen
es: Restaurar todos los demás
fr: Rétablir les autres
hu: Többi visszaállítása
it: Ripristina altro
ru: Восстановить все остальные

source: This window
cs: Toto okno
de: Dieses Fenster
es: Esta ventana
fr: Cette fenêtre
hu: Ez az ablak
it: Questa finestra
ru: Это окно

source: Application
cs: Aplikaci
de: Anwendung
es: Aplicación
hu: Alkalmazás
it: Applicazione
ru: Программа

source: Other apps
cs: Ostatní aplikace
de: Andere Anwendungen
es: Otras aplicaciones
fr: Autres applications
hu: Többi alkalmazás
it: Altre applicazioni
ru: Другие программы

source: Show other apps
cs: Ukázat ostatní aplikace
de: Zeige and. Anwendungen
es: Mostrar otras aplicaciones
fr: Montrer les autres
hu: Többi alk. megj.
it: Mostra altre applicazioni
ru: Показать другие программы

source: About
cs: O XaAES
de: Über XaAES
es: Acerca de
fr: A propos de
hu: Névjegy
it: Circa XaAES
ru: О XaAES

source: Task Manager
cs: Správce úloh
es: Gestor de tareas
fr: Gestionnaire des tâches
hu: Feladatkezelö
ru: Менеджер задач

source: System window & Alerts log
cs: Systémové okno a protokol varování
de: System-Infos & Meldungen
es: Sistema & Registro de Alertas
fr: Fenêtre système & journal des alertes
hu: Rendszer ablak & Figyelmeztetések
it: Finestra sistema & registro avvisi
ru: Окно системы и журнал ощибок

source: Applications
cs: Aplikace
de: Anwendungen
es: Aplicaciones
hu: Alkalmazások
it: Applicazioni
ru: Программы

source: Alerts
cs: Varování
de: Meldungen
es: Alertas
fr: Alertes
hu: Figyelmeztetések
it: Avvisi
ru: Предупреждения

source: Environment
cs: Prostøedí
de: Umgebung
es: Entorno
fr: Environnement
hu: Környezet
it: Ambiente
ru: Окружение

source: System
cs: Systém
es: Sistema
fr: Système
hu: Rendszer
it: Sistema
ru: Система

source: Video:%dx%dx%d,%d colors, format: %s
cs: Obraz:%dx%dx%d,%d barev, formát: %s
de: Video:%dx%dx%d,%d Farben, Format: %s
es: Video:%dx%dx%d,%d colores, formato: %s
fr: Vidéo:%dx%dx%d,%d couleurs, format: %s
hu: Video:%dx%dx%d,%d szín, formátum: %s
it: Video:%dx%dx%d,%d colori, formato: %s
ru: Видео:%dx%dx%d,%d цветов, формат: %s

source: MEMPROT:%s
cs: MEM-pr.:%s
es: PROTMEM:%s
fr: PROTMEM:%s
it: PROTMEM:%s

source: OFF
cs: Vypnuto
de: AUS
es: Apagado
fr: Inactive
hu: Ki
it: Inattivo
ru: ВЫКЛ

source: ON
cs: Zapnuto
de: AN
es: Encendido
fr: Active
hu: Be
it: Attivo
ru: ВКЛ

source: Switch keyboard layout, current:
de: Tastaturbelegung umschalten, aktuell:
es: Cambiar configuración teclado, actual:
fr: Changer langue du clavier, actuel:
it: Cambia lingua tastiera, attuale:
ru: Переключить клавиатуру, сейчас:

source: default
de: standard
es: por defecto
fr: standard
it: standard
ru: по умолчанию

source: [2][Quit All][Cancel|OK]
cs: [2][Ukonèit v¹e][Zru¹it|OK]
de: [2][Alle beenden][Abbruch|OK]
es: [2][Terminar todo][Anular|OK]
fr: [2][Tout quitter][Annuler|OK]
hu: [2][Mind bezárása][Mégsem|OK]
it: [2][Chiudi tutto][Annulla|OK]
ru: [2][Закрыть все][Отмена|ОК]

source: [2][Leave XaAES][Cancel|OK]
cs: [2][Opustit XaAES][Zru¹it|OK]
de: [2][XaAES beenden][Abbruch|OK]
es: [2][Terminar XaAES][Anular|OK]
fr: [2][Quitter XaAES][Annuler|OK]
hu: [2][XaAES bezárása][Mégsem|OK]
it: [2][Uscita da XaAES][Annulla|OK]
ru: [2][Выйти из XaAES][Отмена|ОК]

source: [2][Restart XaAES][Cancel|OK]
cs: [2][Zastavit XaAES][Zru¹it|OK]
de: [2][XaAES neustarten][Abbruch|OK]
es: [2][Reinicializar XaAES][Anular|OK]
fr: [2][Redémarrer XaAES][Annuler|OK]
hu: [2][XaAES újraindítása][Mégsem|OK]
it: [2][Riavvia XaAES][Annulla|OK]
ru: [2][Перезапустить XaAES][Отмена|ОК]

source: [2][Halt System][Cancel|OK]
cs: [2][Zastavit systém][Zru¹it|OK]
de: [2][System anhalten][Abbruch|OK]
es: [2][Apagar sistema][Anular|OK]
fr: [2][Arrêter le système][Annuler|OK]
hu: [2][Rendszer leállítása][Mégsem|OK]
it: [2][Arresto sistema][Annulla|OK]
ru: [2][Остановить систему][Отмена|ОК]

source: [2][XaAES had a problem][Continue|Halt]
de: [2][Problem bei XaAES][Weiter|Abbruch]
es: [2][XaAES tuvo un problema][Contiuar|Detener]
fr: [2][XaAES a rencontré un problème][Continuer|Arrêter]
it: [2][XaAES ha avuto un problema][Continua|Arresta]
ru: [2][Ошибка XaAES][Продолжить|Прервать]

source: [1][Snapper could not save snap!|ERROR: %d][OK]
cs: [1][Nelze ulo¾it snímek obrazovky!|CHYBA: %d][OK]
de: [1][Snapper konnte das Bildschirmfoto|nicht sichern!|FEHLER: %d][OK]
es: [1][¡Imposible guardar pantallazo!|ERROR: %d][OK]
fr: [1][Impossible de sauver l'image !|ERROR: %d][OK]
hu: [1][A képlopó nem tudja|elmenteni a fájlt!|HIBA: %d][OK]
it: [1][Impossibile salvare l'immagine!|ERRORE: %d][OK]
ru: [1][Не могу сохранить снимок!|ОШИБКА: %d][ОК]

source: [1][Cannot snap topwindow as|parts of it are offscreen!][OK]
cs: [1][Nelze udìlat snímek aktivního okna,|proto¾e jeho èást le¾í mimo obraz!][OK]
de: [1][Das oberste Fenster kann nicht|fotografiert werden weil Teile davon|ausserhalb des Bildschirms liegen!][OK]
es: [1][Imposible capturar ventana|¡Parcialmente fuera de la pantalla!][OK]
fr: [1][Impossible de capturer la|fenêtre supérieure. Une partie|se trouve hors de l'écran !][OK]
hu: [1][Az aktív ablakról nem lehet|képernyöképet készíteni képernyön|kívülre esö részei vannak!][OK]
it: [1][Impossibile catturare la|finestra superiore. Si trova|parzialmente fuori dallo schermo!][OK]
ru: [1][Не могу сделать снимок активного окна тк.|его часть за пределами экрана!][ОК]

source: [1]['xaaesnap' process not found.|Start 'xaaesnap.prg' and try again|or define snapshot in xaaes.cnf][OK]
cs: [1][Proces 'xaaesnap' nenalezen.|Spus»te 'xaaesnap.prg' a zkuste to znovu nebo|nastavte program pro snímkování v xaaes.cnf][OK]
de: [1][Prozess 'xaaesnap' nicht gefunden.|Bitte 'xaaesnap.prg' starten und|nochmal versuchen oder snapshot|in xaaes.cnf definieren.][OK]
es: [1]['xaaesnap' proceso no encontrado.|Ejecutar 'xaaesnap.prg' e intentar de nuevo|o defina snapshot en xaaes.cnf][OK]
fr: [1][Programme 'xaaesnap' non|trouvé. Lancer 'xaaesnap.prg'|et réessayez ou déclarez un|programme dans xaaes.cnf][OK]
hu: [1]['xaaesnap' nem található.|Indítsd el a 'xaaesnap.prg'-ot és|próbáld újra vagy adj meg más|alkalmazás az 'xaaes.cnf'-ban][OK]
it: [1][Processo 'xaaesnap' non trovato.|Avvia 'xaaesnap.prg' e prova ancora|o definisci lo snapshot in xaaes.cnf][OK]
ru: [1][Процесс 'xaaesnap' не найден.|Запустите 'xaaesnap.prg' и попробуйте снова|или сконфигурируйте снимок в xaaes.cnf][ОК]

source: [2][What do you want to snap?][Block|Full screen|Top Window|Cancel]
cs: [2][Èeho snímek chcete vytvoøit?][Blok|Celá obrazovka|Horní okno|Zru¹it]
de: [2][Was soll fotografiert werden?][Block|Ganzer Schirm|Fenster|Abbruch]
es: [2][¿Qué desea capturar?][Bloque|Panatalla completa|Ventana|Anular]
fr: [2][Quelle partie capturer ?][Région|Tout l'écran|Fenêtre supérieure|Annuler]
hu: [2][Miröl akarsz képernyöképet?][Téglalap|Képernyö|Aktív ablak|Mégsem]
it: [2][Cosa vuoi catturare?][Blocco|Schermo intero|Finestra superiore|Annulla]
ru: [2][Снимок чего вы хотите сделать?][Блока|Всего экрана|Активного окна|Отмена]

source: [1][%s: wrong size (file:%ld,header:%ld)][Run anyway|Cancel]
de: [1][%s: falsche Gr÷áe (Datei:%ld,Header:%ld)][Starten|Abbruch]
es: [1][%s: tamaño incorrecto|(fichero:%ld,cabecera:%ld)][Ejecutar|Cancelar]
fr: [1][%s: taille incorrecte|(fichier:%ld,en-tête:%ld)][Continuer|Annuler]
it: [1][%s: dimensioni errate|(file:%ld,header:%ld)][Continua|Annulla]
ru: [1][%s: неправильный размер|(файл:%ld,заголовок:%ld)][Все равно запустить|Отмена]

source: Launch Program
cs: Spustit program
de: Programm starten
es: Ejecutar Programa
fr: Lancer un programme
hu: Program idítása
it: Avvio Programma
ru: Запустить программу

source: Load Gradient
de: Gradient laden
es: Cargar gradiente
fr: Charger dégradé
it: Carica gradiente
ru: Загрузить градиент

source: Load Image
de: Bild laden
es: Cargar imagen
fr: Charger une image
it: Carica immagine
ru: Загрузить картинку

source: Load Palette
de: Palette laden
es: Cargar paleta
fr: Charger palette
it: Carica palleta
ru: Загрузить палитру

source: Load Config
de: Konfiguration laden
es: Cargar configuración
fr: Charger configuration
it: Carica configurazione
ru: Загрузить конфигурация

source: $SDMASTER is not a valid program: %s (use the taskmanager)
cs: $SDMASTER není platný program: %s (pou¾ijte správce úloh)
de: $SDMASTER ist kein gültiges Programm: %s (bitte Taskmanager verwenden)
es: $SDMASTER no es un programa valido: %s (use el gestor de tareas)
fr: $SDMASTER n'est pas un programme valide: %s (utiliser le gestionnaire de tâches)
hu: $SDMASTER nem futtatható: %s (használd a feledatkezelÕt)
it: $SDMASTER non è un programma valido: %s (usare il taskmanager)
ru: $SDMASTER не является программой: %s (воспользуйтесь менеджером задач)

source: Could not load %s.tbl from %s (%ld)
cs: Nelze naèíst %s.tbl z %s (%ld)
de: Konnte %s.tbl von %s nicht laden (%ld)
es: Imposible cargar %s.tbl desde %s (%ld)
fr: Impossible de charger %s.tbl depuis %s (%ld)
hu: %s.tbl -t nem lehet betölteni (%s) (%ld)
it: Impossibile caricare %s.tbl da %s (%ld)
ru: Не могу загрузить %s.tbl из %s (%ld)

source: Cannot terminate AES system proccesses!
cs: Nelze ukonèit procesy systému AES!
de: Kann AES-Systemprozesse nicht beenden!
es: ¡Imposible terminar los procesos del sistema AES!
fr: Impossible de quitter les processus système de l'AES !
hu: AES rendszer folyamatokat nem lehet leállítani!
it: Impossibile chiudere i processi del sistema AES!
ru: Не могу прервать системный процесс AES!

source: Cannot kill XaAES!
cs: Nelze zabít XaAES!
de: XaAES kann nicht gekillt werden!
es: ¡Imposible forzar la salida de XaAES!
fr: Impossible de forcer XaAES à quitter !
hu: XaAES-t nem lehet kilÕni!
it: Impossibile forzare la chiusura di XaAES!
ru: Не могу остановить XaAES!

source: XaAES: No AES Parameter Block, returning.
cs: XaAES: ®ádný blok parametrù AES; vracím se.
de: XaAES: Kein AES Parameter-Block, Abbruch.
es: XaAES: Ningún bloque de parametros AES. Volver.
fr: XaAES: Pas de bloc paramètres AES. Quitte.
hu: XaAES: Nincs AES paraméter blokk ...
it: XaAES: Nessun blocco parametri AES. Ritorno.
ru: XaAES: Блок параметров не принадлежит AES, возврат.

source: XaAES: Non-AES process issued AES system call %i, killing it!
cs: XaAES: Ne-AES proces vyslal systémové volání AES %i; zabíjím ho!
de: XaAES: Nicht-AES Prozess gibt AES-Systemaufruf %i aus. Wird beendet!
es: XaAES: Ningún proceso AES efectuó una llamada al AES %i,¡Forzando salida!
fr: XaAES: Un processus non AES a fait l'appel système AES %i. Processus tué !
hu: XaAES: Nem AES-hez tartozó process AES hívást (%i) kezdeményezett!
it: XaAES: AES system call %i emessa da processo non AES. Chiusura forzata !
ru: XaAES: Не-AES процесс инициировал системный вызов AES %i, прерываю его!

source: %s: Validate OBTREE for %s failed, object ptr = %lx, killing it!
cs: %s: Ovìøení OBTREE pro %s selhalo, objekt ptr = %lx, zabíjím ho!
de: %s: Bestätigung OBTREE für %s fehlgeschlagen, Objekt-Ptr = %lx. Wird beendet!
es: %s: Validación del OBTREE para %s falló, objecto ptr = %lx, ¡forzando salida!
fr: %s: Echec validatation OBTREE pour %s, pointeur objet = %lx, processus tué !
hu: %s: %s OBTREE validácóó nem sikerült (objektum ptr = %lx), megszakitás!
it: %s: Validazione OBTREE di %s fallita, oggetto ptr = %lx. Chiusura forzata!
ru: %s: Ошибка валидации OBTREE для %s , объект ptr = %lx, прерываю его!
