Repository: freemint/freemint
Catalog: xaaes/src.*/po/*.po
Languages: cs, de, es, fr, hu, it, ru

source: attach_extension for %u failed, out of memory?
cs: attach_extension pro %u selhalo; nedostatek pamìti?
de: attach_extension für %u fehlgeschlagen. Zuwenig Speicher?
es: attach_extension para %u falló, ¿memoria exhausta?
fr: attach_extension pour %u a échoué, plus de mémoire ?
hu: %u attach_extension hívása nem sikerült, kevés a memória?
it: attach_extension per %u fallita, memoria esaurita?
ru: ошибка attach_extension для %u , не хватает памяти?

source: umalloc for %u failed, out of memory?
cs: umalloc pro %u selhalo; nedostatek pamìti?
de: umalloc für %u fehlgeschlagen. Zuwenig Speicher?
es: umalloc para %u falló, ¿memoria exhausta?
fr: umalloc pour %u a échoué, plus de mémoire ?
hu: %u umalloc hívása nem sikerült, kevés a memória?
it: umalloc per %u fallito, memoria esaurita?
ru: ошибка umalloc для %u , не хватает памяти?

source: XaAES: Print dialogs unavailable with current VDI.
cs: XaAES: Dialog tisku nedostupný s aktuálním VDI.
de: XaAES: Druckdialoge sind mit diesem VDI nicht verfügbar.
es: XaAES: Dialogos de impresión no disponibles con este VDI.
fr: XaAES: Dialogue d'impression non disponoble avec cette VDI.
hu: XaAES: Nyomtató párbeszédablakot nem támogatja ez a VDI.
it: XaAES: Pannello di stampa non disponibile con questo VDI.
ru: XaAES: Диалоговое окно печати невозможно с данным VDI.

source: launch: Cannot enter single-task-mode. Already in single-task-mode: %s(%d).
cs: launch: Nelze pøejít do jednoúlohového re¾imu. Re¾im ji¾ jednoúlohový je: %s(%d).
de: launch: Kann Single-Task Modus nicht starten. Bereits im Single-Task Modus: %s(%d).
es: launch: Imposible entrar en modo monotarea. Modo monotarea ya en uso: %s(%d).
fr: launch: Impossible de passer en mode mono-tâche. Déjà en mono-tâche: %s(%d).
hu: launch: Nem lehet single-task-mode-ba váltani, mivel már abban vagyunk: %s(%d).
it: launch: Impossibile passare in modo single-task. Modo già in uso: %s(%d).
ru: launch: Не могу выбрать однозадачный режим. Уже в однозадачном режиме: %s(%d).

source: XaAES: %s%s, client with no globl_ptr, killing it!
cs: XaAES: %s%s, klient bez globl_ptr; zabíjím ho!
de: XaAES: %s%s, Anwendung ohne globl_ptr, wird beendet!
es: XaAES: %s%s, cliente sin ningún globl_ptr, ¡forzando salida!
fr: XaAES: %s%s, client sans globl_ptr, exécution terminée !
hu: XaAES: %s%s, kliens globl_ptr nélkül, bezárás!
it: XaAES: %s%s, cliente senza globl_ptr, Chiusura forzata!
ru: XaAES: %s%s, клиент без globl_ptr, закрываю его!

source: XaAES: AES shell already running!
cs: XaAES: Shell AES (pracovní plocha) ji¾ bì¾í!
de: XaAES: AES-Shell (Desktop) ist bereits aktiv!
es: XaAES: ¡Existe un AES shell ejecutándose actualmente!
fr: XaAES: Le shell AES tourne déjà !
hu: XaAES: Már fut egy AES-shell!
it: XaAES: Shell AES già in esecuzione!
ru: XaAES: Оболочка AES уже запущена!

source: XaAES: No AES shell set, see 'shell =' configuration variable in xaaes.cnf.
cs: XaAES: Nenastaven ¾ádný shell AES; viz promìnná 'shell =' v xaaes.cnf.
de: XaAES: Keine AES-Shell angemeldet, siehe Konfigurationsvariable 'shell =' in xaaes.cnf.
es: XaAES: Ningún AES shell establecido, ver variable de configuración 'shell =' en xaaes.cnf.
fr: XaAES: Pas de shell AES défini ; voir la variable de configuration 'shell =' dans xaaes.cnf.
hu: XaAES: Nincs beállitva AES-shell ('shell=' konfiguráció az xaaes.cnf fájlban).
it: XaAES: Nessuna shell AES definita, vedi variabile di configurazione 'shell =' in xaaes.cnf.
ru: XaAES: Не выбрана оболочка AES, проверьте переменную 'shell =' в файле xaaes.cnf.

source: Clients 002
cs: Klienti 002
de: Anwendungen 002
es: Clientes 002
hu: Kliensek 002
it: Clienti 002
ru: Программы 002

source: xa_help.txt
cs: xa_help.cs
de: xa_help.de
es: xa_help.es
fr: xa_help.fr
hu: xa_help.hu
it: xa_help.it
ru: xa_help.ru

source: CURSOR-UP
de: PFEIL-HOCH
es: CURSOR-ARRIBA
fr: FLECHE HAUT
hu: KURZOR-FEL

source: CURSOR-DOWN
de: PFEIL-RUNTER
es: CURSOR-ABAJO
fr: FLECHE BAS
hu: KURZOR-LE

source: CURSOR-RIGHT
de: PFEIL-RECHTS
es: CURSOR-DRCHA
fr: FLECHE DROITE
hu: KURZOR-JOBB

source: CURSOR-LEFT
de: PFEIL-LINKS
es: CURSOR-IZQ
fr: FLECHE GAUCHE
hu: KURZOR-BAL

source: SPACE
de: Leertaste
es: ESPACIO
fr: ESPACE
hu: ÜRES

source: Resize
de: Gr÷ße ändern
es: Redimensionar
fr: Changer la taille
it: Ridimensiona
ru: Масштаб

source: Move
de: Verschieben
es: Mover
fr: Déplacer
it: Sposta
ru: Передвинуть

source: Close
de: Schlieáen
es: Cerrar
fr: Fermer
it: Chiudi
ru: Закрыть

source: Full
de: Maximieren
es: Maximizar
fr: Maximiser
it: Massimizza
ru: Развернуть

source: Info
de: Information
es: Información
fr: Information
hu: Információ
it: Informazione
ru: Информация

source: Scroll up
de: Nach oben rollen
es: Desplazarse arriba
fr: Défilement en haut
it: Scorri in alto
ru: Прокрутить вверх

source: Scroll down
de: Nach oben rollen
es: Desplazarse abajo
fr: Défilement en bas
it: Scorri in basso
ru: Прокрутить вниз

source: Vertical slide
de: Vertikal rollen
es: Desplazamiento vertical
fr: Défilement vertical
it: Scorrimento verticale
ru: Вертикальные подсказки

source: Scroll left
de: Nach links rollen
es: Desplazarse izquierda
fr: Défilement à gauche
it: Scorri a sinistra
ru: Прокрутить влево

source: Scroll right
de: Nach rechts rollen
es: Desplazarse derecha
fr: Défilement à droite
it: Scorri a destra
ru: Прокрутить вправо

source: Horizontal slide
de: Horizontal rollen
es: Desplazamiento horizontal
fr: Défilement horizontal
it: Scorrimento orizzontale
ru: Горизонтальные подсказки

source: Iconify
de: Ikonifizieren
es: Minimizar
fr: Iconifier
it: Iconizza
ru: Иконизировать

source: Hide
de: Verstecken
es: Ocultar
fr: Masquer
it: Nascondi
ru: Скрыть

source: Page up
de: Seite hoch
es: Página arriba
fr: Page haut
it: Pagina su
ru: Страница вверх

source: Page down
de: Seite runter
es: Página abajo
fr: Page bas
it: Pagina giù
ru: Страница вниз

source: Page left
de: Seite links
es: Página izquierda
fr: Page gauche
it: Pagina sinistra
ru: Страница влево

source: Page right
de: Seite rechts
es: Página derecha
fr: Page droite
it: Pagina destra
ru: Страница вправо

source: OK
ru: ОК

source: W:
de: B:
fr: L:
it: L:
ru: Ш:

source: H:
cs: V:
it: A:
ru: В:

source: Color:
cs: Barvy:
de: Farben:
fr: Couleurs:
hu: Szín:
it: Colore:
ru: Цвет:

source: Kill
cs: Zabít
de: Terminieren
fr: Terminer
hu: Kilövés
it: Termina
ru: Прервать

source: The GEMÖ compatible AES for FreeMiNT
de: Das GEMÖ-kompatible AES für FreeMiNT

source: INSERT
de: EINFÜGEN

source: DELETE
de: LÖSCHEN

source: XaAES Ain't the AES
it: L'AES compatibile GEM277 per FreeMiNT
